dotfiles/emacs/emacs.d/init.org
#+TITLE: My Emacs configuration
#+AUTHOR: GTrunSec
#+EMAIL: gtrunsec@hardenedlinux.org
#+DATE: 22 July 2019
#+KEYWORDS: Emacs Profile
#+LANGUAGE:  en cn
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t pri:t
#+SETUPFILE: ~/org-notes/setup/hugo.local
#+SETUPFILE: ~/org-notes/setup/darkcss.local
#+hugo_publishdate: `org-time-stamp-rounding-minutes`
#+hugo_auto_set_lastmod: t
#+HUGO_categories: profile
#+HUGO_tags: Emacs
#+PROPERTY: header-args :tangle "~/.emacs.d/init.el"

* learning emacs
** [[https://doc.endlessparentheses.com/functions.html#main_content][Emacs Online Documentation]]
** [[https://emacs.stackexchange.com/tags][Tags - Emacs Stack Exchange]]
* Package management
** Emacs package configuration
   #+begin_src emacs-lisp :tangle yes
(require 'package)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))


(setq package-enable-at-startup nil
      package-check-signature nil
      package-archives '(("GNU ELPA"     . "http://elpa.gnu.org/packages/")
                        ; ("MELPA Stable" . "http://stable.melpa.org/packages/")
                         ("MELPA"        . "http://melpa.org/packages/")
                         ("ORGMODE"      . "http://orgmode.org/elpa/"))
      package-archive-priorities  '(("ORGMODE"      . 15)
                         ;           ("MELPA Stable" . 10)
                                    ("GNU ELPA"     . 5)
                                    ("MELPA"        . 10)))

;;27 version unness
(package-initialize)

(straight-use-package 'use-package)
(setq use-package-always-ensure t)

(setq inhibit-startup-message t)
(setq initial-scratch-message "")

(require 'server)
(unless (server-running-p)
  (server-start))


   #+end_src
** Add keychord support
   #+begin_src emacs-lisp :tangle yes
(use-package use-package-chords
  :straight t
  :config (key-chord-mode 1))
   #+end_src
** Hydra
   #+begin_src emacs-lisp :tangle yes
(use-package lv
  :straight t
)

(use-package hydra
  :demand t
  :straight t
)
#+end_src

** General
   #+begin_src emacs-lisp :tangle yes

(use-package no-littering
  :straight t)
(require 'recentf)

(add-to-list 'recentf-exclude no-littering-etc-directory)

(setq user-full-name "GTrunSec"
      user-mail-address "gtrunsec@hardenedlinux.org")
  (use-package general
    :straight t)

 (use-package diminish
    :straight t)
   #+end_src
** Auto-update
   #+begin_src emacs-lisp :tangle yes
(use-package auto-package-update
  :straight t
  :config
  (setq auto-package-update-delete-old-versions t
        auto-package-update-hide-results t)
  (auto-package-update-maybe))

   #+end_src
** Define Coustom file
   #+begin_src emacs-lisp :tangle yes
 ;; Don't screw up my files with custom
;(setq custom-file (format "%s/custom.el" user-emacs-directory))
(setq custom-file (no-littering-expand-etc-file-name "custom.el"))

 (load custom-file 'noerror)
 (defalias 'yes-or-no-p 'y-or-n-p)
 ;; Silence!!!!!!

   #+end_src

** ✘ CANCELED tangling Emacs.init file
CLOSED: [2019-07-24 Wed 23:42]
- State "✘ CANCELED" from              [2019-07-24 Wed 23:42] \\
  replaced Makefile compile org init
   #+begin_src emacs-lisp :tangle yes
;; (defun gtrun-tangle-byte-compile-org ()
;;   "Tangles main.org and byte compiles ~/.emacs.d/"
;;   (interactive)
;;   (when (equal (buffer-name)
;; 		 (concat "init.org"))
;;      (org-babel-tangle)

;;     ;; Recompile plugins
;;      (byte-recompile-directory (expand-file-name user-emacs-directory) 0)

;;     ;; ;; Recompile init file (FIXME: commented as long as org-mode and matlab problem remains!)
;;     ;; (byte-recompile-file (format "%s/init.el" user-emacs-directory) t 0 nil)
;;     ))
   #+end_src
** [[https://github.com/iqbalansari/restart-emacs][iqbalansari/restart-emacs: A simple emacs package to restart emacs from within emacs]]
** Exec-path-from-shell
    #+begin_src emacs-lisp :tangle yes
      (use-package exec-path-from-shell
        :straight t
        :if (memq window-system '(mac ns))
        :config
        (exec-path-from-shell-initialize)

        )
    #+end_src

* Keybinds
** Xah-lee-fly-key
*** Normal-keyboard
**** load-path
#+begin_src emacs-lisp :tangle yes

  (use-package xah-fly-key-normal
   :load-path "./setup"
   :if (memq window-system '(mac ns)))
#+end_src

I would like use ErgoDox keyboard on my linux environment

#+begin_src emacs-lisp :tangle yes
  ;; (add-to-list 'load-path (expand-file-name "~/.emacs.d/setup"))
  ;; (require 'xah-fly-key-ergo)
#+end_src
**** default-layout
#+begin_src emacs-lisp :tangle "./setup/xah-fly-key-normal.el"

 (straight-use-package 'xah-fly-keys)
  (require 'xah-fly-keys)

  (add-hook 'xah-fly-command-mode-activate-hook
            (lambda ()
              (setq xah-fly-insert-state-q nil)))
  ;; automatic save buffer when switching to command mode
  ;; (add-hook 'xah-fly-command-mode-activate 'xah-fly-save-buffer-if-file)

  ;;(xah-fly-keys-set-layout "qwerty") 

  (xah-fly-keys 1)


 #+end_src

**** ✍ NOTE leader-key-map
#+begin_src emacs-lisp :tangle "./setup/xah-fly-key-normal.el"
  (require 'xah-fly-keys)

  (xah-fly--define-keys
   (define-prefix-command 'xah-fly-leader-key-map)
   '(
     ("2" . org-keymap)
     ("8" . git-keymap)
     ("fr" . counsel-recentf)
     ;;("<tab>" . spacemacs/alternate-buffer)
     ("ff" . counsel-fd-file-jump)
     ("fj" . counsel-fd-dired-jump)
     ("RET" . helm-bookmarks)
     ;; treemacs
     ("tt" . treemacs-toggle)
     ("tf" . treemacs-fine-file)
     ;; helm
     ("bb" . switch-to-buffer)
     ;; isearch
     ("y" . xah-search-current-word)
     ;; search
     ("sa" . counsel-ag)
     ("sr" . counsel-rg)
     ;; imenu
     ("il" . imenu-list-smart-toggle)
     ))

#+end_src


- define a custom keymap
#+begin_src emacs-lisp :tangle "./setup/xah-fly-key-normal.el"
  (xah-fly--define-keys
   ;; create a keymap my-keymap
   (define-prefix-command 'git-keymap)
   '(
     ("d" . magit-remove-git-lock-file)
     ("r" . magit-reset-hard)
     ;;
     ))
  (xah-fly--define-keys
   ;; create a keymap org-keymap
   (define-prefix-command 'org-keymap)
   '(
     ("i" . org-clock-in)
     ("o" . org-clock-out)
     ("l" . org-clcok-in-last)
     ("r" . org-starter-refile-by-key)
     ("s" .org-starter-select-file-other-window)
     ;;
     ))
#+end_src
**** define-xah-fly-key-map
    #+begin_src emacs-lisp :tangle "./setup/xah-fly-key-normal.el"

;; edit
(define-key xah-fly-key-map (kbd "C-a") 'beginning-of-visual-line)
(define-key xah-fly-key-map (kbd "C-0") 'delete-region)
(define-key xah-fly-key-map (kbd "C-n") 'next-line)


;; org-mode
(define-key xah-fly-key-map (kbd "C-c l") 'org-mac-grab-link)
(define-key xah-fly-key-map (kbd "C-c a") 'org-agenda)
(define-key xah-fly-key-map (kbd "C-c w") 'helm-deft)

;; iseach
(define-key xah-fly-key-map (kbd "C-s") 'swiper-isearch)


;; scrolling
(define-key xah-fly-key-map (kbd "C-v") 'scroll-up-command)

    #+end_src

**** command-init(key)
    #+begin_src emacs-lisp :tangle "./setup/xah-fly-key-normal.el"
            (defun xah-fly-command-mode-init ()
              "Set command mode keys.
            Version 2017-01-21"
              (interactive)
              (xah-fly--define-keys
               xah-fly-key-map
               '(
                 ;; IMPORTANT, These keys are all dvorak keys
                 ("~" . nil)
                 (":" . nil)

                 ("SPC" . xah-fly-leader-key-map)
                 ("2" . org-agenda)
                 ("q" . quit-window)
                 ("a" . counsel-M-x)
                 ("w" . snails)
                 ("i" . previous-line)
                 ("k" . next-line )
                 ("b" . backward-word)
                 ("h" . forward-word)
                 ("l" . backward-char)
                 ("j" . forward-char)
                 ("f" . xah-fly-insert-mode-activate)
                 ("[" . xah-backward-punct )
                 ("]" . xah-forward-punct)
                 ("g" . set-mark-command)
                 ("y" . undo)
                 ("v" . xah-paste-or-paste-previous)
                 ("c" . xah-copy-line-or-region)
                 ("x" . xah-cut-line-or-region)
                 ("t" . set-mark-command)
                 ("6" . xah-select-block)
                 ("7" . xah-select-line)
                 ("8" . xah-extend-selection)
                 ("9" . xah-select-text-in-quote)
                 ("0" . xah-pop-local-mark-ring)
                 ("n" . isearch-forward)
                 ))
              (define-key xah-fly-key-map (kbd ".") 'gtrun-xah-dot-fly-key)
              (define-key xah-fly-key-map (kbd "p") 'gtrun-xah-fly-key)
              (define-key xah-fly-key-map (kbd "M-<SPC>") 'xah-fly-command-mode-activate)

              (define-key xah-fly-key-map (kbd "-") 'gtrun-xah-minus-fly-key)
              (define-key xah-fly-key-map (kbd "/") 'gtrun-xah-slash-fly-key)
              (define-key xah-fly-key-map (kbd ",") 'gtrun-xah-comma-fly-key)
              )
    #+end_src

    #+RESULTS:
    : xah-fly-command-mode-init

**** special-key-to-mode-map
    #+begin_src emacs-lisp :tangle "./setup/xah-fly-key-normal.el"
            (defun gtrun-xah-dot-fly-key ()
              "key `.'"
              (interactive)
              (cond
               ;; ((eq major-mode 'dired-mode) (call-interactively 'd))
               ((eq major-mode 'dired-mode) (call-interactively 'hydra-dired/body))
               ((eq major-mode 'w3m-mode) (call-interactively 'scroll-up))
               (t nil)))

            (defun gtrun-xah-fly-key ()
              "key `p'"
              (interactive)
              (cond
               ;; ((eq major-mode 'dired-mode) (call-interactively 'd))
               ((eq major-mode 'dired-mode) (call-interactively 'xah-open-in-external-app))
               (t nil)))


      (defun gtrun-xah-minus-fly-key ()
              "key `-'"
              (interactive)
              (cond
               ;; ((eq major-mode 'dired-mode) (call-interactively 'd))
               ((eq major-mode 'dired-mode) (call-interactively 'vinegar/up-directory))
               (t nil)))

            (defun gtrun-xah-slash-fly-key ()
              "key `/'"
              (interactive)
              (cond
               ;; ((eq major-mode 'dired-mode) (call-interactively 'd))
               ((eq major-mode 'dired-mode) (call-interactively 'vinegar/dired-diff))
               ((eq major-mode 'w3m-mode) (call-interactively 'w3m-bookmark-add-current-url))
               ((eq major-mode 'org-mode) (call-interactively 'helm-org-in-buffer-headings))
               ((eq major-mode 'org-agenda-mode) (call-interactively 'org-agenda-filter-by-tag))

               (t nil)))


            (defun gtrun-xah-comma-fly-key ()
              "key `,'"
              (interactive)
              (cond
               ;; ((eq major-mode 'dired-mode) (call-interactively 'd))
               ((eq major-mode 'w3m-mode) (call-interactively 'scroll-down))
               (t nil)))

      (provide 'xah-fly-key-normal)
    #+end_src
*** Ergo layout [Linux]
**** install
#+begin_src emacs-lisp :tangle yes
(use-package xah-fly-key-ergo
:if (eq system-type 'gnu/linux)
:load-path "./setup")
#+end_src

#+begin_src emacs-lisp :tangle "./setup/xah-fly-key-ergo.el"
  (straight-use-package 'xah-fly-keys)
  (require 'xah-fly-keys)

  (add-hook 'xah-fly-command-mode-activate-hook
            (lambda ()
              (setq xah-fly-insert-state-q nil)))
  ;; automatic save buffer when switching to command mode
  ;; (add-hook 'xah-fly-command-mode-activate 'xah-fly-save-buffer-if-file)

  ;;(xah-fly-keys-set-layout "qwerty") 

  (xah-fly-keys 1)
#+end_src
**** leader-key-map
#+begin_src emacs-lisp :tangle "./setup/xah-fly-key-ergo.el"


(xah-fly--define-keys
   (define-prefix-command 'xah-fly-leader-key-map)
   '(
     ("2" . org-keymap)
     ("8" . my-keymap)
     ("fr" . counsel-recentf)
     ;;("<tab>" . spacemacs/alternate-buffer)
     ("ff" . counsel-fd-file-jump)
     ("fj" . counsel-fd-dired-jump)
     ("RET" . helm-bookmarks)
     ;; treemacs
     ("tt" . treemacs-toggle)
     ("tf" . treemacs-fine-file)
     ;; helm
     ("bb" . switch-to-buffer)
     ;; isearch
     ("y" . xah-search-current-word)
     ;; search
     ("sa" . counsel-ag)
     ("sr" . counsel-rg)
   
     ))
#+end_src

- define a custom keymap

#+begin_src emacs-lisp :tangle "./setup/xah-fly-key-ergo.el"
  (xah-fly--define-keys
   ;; create a keymap my-keymap
   (define-prefix-command 'git-keymap)
   '(
     ("d" . magit-remove-git-lock-file)
     ("r" . magit-reset-hard)
     ;;
     ))
  (xah-fly--define-keys
   ;; create a keymap org-keymap
   (define-prefix-command 'org-keymap)
   '(
     ("i" . org-clock-in)
     ("o" . org-clock-out)
     ("l" . org-clcok-in-last)
     ("r" . org-starter-refile-by-key)
     ("s" .org-starter-select-file-other-window)
     ;;
     ))

#+end_src
**** define-xah-fly-key-map
    #+begin_src emacs-lisp :tangle "./setup/xah-fly-key-ergo.el"

;; edit
(define-key xah-fly-key-map (kbd "C-a") 'beginning-of-visual-line)
(define-key xah-fly-key-map (kbd "C-0") 'delete-region)
(define-key xah-fly-key-map (kbd "C-n") 'next-line)


;; org-mode
(define-key xah-fly-key-map (kbd "C-c l") 'org-mac-grab-link)
(define-key xah-fly-key-map (kbd "C-c a") 'org-agenda)
(define-key xah-fly-key-map (kbd "C-c w") 'helm-deft)

;; iseach
(define-key xah-fly-key-map (kbd "C-s") 'swiper-isearch)


;; scrolling
(define-key xah-fly-key-map (kbd "C-v") 'scroll-up-command)

    #+end_src

**** command-init(key)
    #+begin_src emacs-lisp :tangle "./setup/xah-fly-key-ergo.el"
      (defun xah-fly-command-mode-init ()
        "Set command mode keys.
      Version 2017-01-21"
        (interactive)
        (xah-fly--define-keys
         xah-fly-key-map
         '(
           ;; IMPORTANT, These keys are all dvorak keys
           ("~" . nil)
           (":" . nil)

           ("SPC" . xah-fly-leader-key-map)
           ("q" . quit-window)
           ("a" . counsel-M-x)
           ("w" . snails)
           ("i" . previous-line)
           ("k" . next-line )
           ("b" . backward-word)
           ("h" . forward-word)
           ("l" . backward-char)
           ("j" . forward-char)
           ("f" . xah-fly-insert-mode-activate)
           ("[" . xah-backward-punct )
           ("]" . xah-forward-punct)
           ("g" . set-mark-command)
           ("i" . undo)
           ("v" . xah-paste-or-paste-previous)
           ("c" . xah-copy-line-or-region)
           ("x" . xah-cut-line-or-region)
           ("t" . set-mark-command)
           ("6" . xah-select-block)
           ("7" . xah-select-line)
           ("8" . xah-extend-selection)
           ("9" . xah-select-text-in-quote)
           ("0" . xah-pop-local-mark-ring)
           ("n" . isearch-forward)
           ))
        (define-key xah-fly-key-map (kbd ".") 'gtrun-xah-dot-fly-key)
        (define-key xah-fly-key-map (kbd "p") 'gtrun-xah-fly-key)
        (define-key xah-fly-key-map (kbd "M-<SPC>") 'xah-fly-command-mode-activate)

        (define-key xah-fly-key-map (kbd "-") 'gtrun-xah-minus-fly-key)
        (define-key xah-fly-key-map (kbd "/") 'gtrun-xah-slash-fly-key)
        (define-key xah-fly-key-map (kbd ",") 'gtrun-xah-comma-fly-key)
        )
    #+end_src
