dotfiles/emacs/emacs.d/init.org
*** Filetype templates
This part is using yatemplate (an over-layer of yasnippet) coupled with auto-insert to have a set of
file type dedicated templates. The templates are available in =third_parties/templates= directory.

#+begin_src emacs-lisp :tangle yes
  (use-package yatemplate
    :straight t
    :after yasnippet
    :config

    ;; Define template directory
    (setq yatemplate-dir (concat user-emacs-directory "private/templates"))

    ;; Coupling with auto-insert
    (setq auto-insert-alist nil)
    (yatemplate-fill-alist)
    (add-hook 'find-file-hook 'auto-insert)
    )
    #+END_SRC
* Compilation
** search frame
*** [[https://github.com/manateelazycat/snails][manateelazycat/snails: A modern, easy-to-expand fuzzy search framework]]
#+begin_src emacs-lisp :tangle "./setup/macos.el"
(use-package snails
  :load-path "./setup/snails"
  :config
  (define-key snails-mode-map [remap next-line] #'snails-select-next-item)
  (add-hook 'snails-mode-hook #'xah-fly-insert-mode-activate)
  )
#+end_src

#+begin_src emacs-lisp :tangle "./setup/linux.el"
  ;; (straight-use-package '(snails :type git
  ;;                                :host github
  ;;                                :repo "manateelazycat/snails"))
  ;;  (define-key snails-mode-map [remap next-line] #'snails-select-next-item)
 (use-package snails
  :load-path "./setup/snails"
  :config
  (define-key snails-mode-map [remap next-line] #'snails-select-next-item)
  (add-hook 'snails-mode-hook #'xah-fly-insert-mode-activate)
  )

#+end_src
** emacs-request
#+begin_src emacs-lisp :tangle yes
(straight-use-package 'request)
(require 'request)
#+end_src
** ripgrep
** color-rg
   - [[https://github.com/manateelazycat/color-rg][manateelazycat/color-rg: Search and refactoring tool based on ripgrep.]]
   #+begin_src emacs-lisp :tangle yes
          (straight-use-package '(color-rg
                                  :type git
                                  :host github
                                  :repo "manateelazycat/color-rg"))

     (define-key isearch-mode-map (kbd "M-s M-s") 'isearch-toggle-color-rg)
     (require 'color-rg)

#+end_src
** flycheck
#+begin_src emacs-lisp :tangle yes
  (use-package flycheck
    :straight t
    :config
    (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc))

    (flycheck-define-checker proselint
      "A linter for prose."
      :command ("proselint" source-inplace)
      :error-patterns
      ((warning line-start (file-name) ":" line ":" column ": "
                (id (one-or-more (not (any " "))))
                (message) line-end))
      :modes (text-mode markdown-mode gfm-mode org-mode))
    )

  (use-package flycheck-stack
    :straight t
    :after flycheck)
#+end_src
** flymake
#+begin_src emacs-lisp :tangle yes
  ;;(remove-hook 'find-file-hook 'flymake-find-file-hook)
#+end_src
** rg.el
- [[https://github.com/dajva/rg.el/tree/450a1e54fb7c690166e61856b0d2002a71ccdf10][dajva/rg.el at 450a1e54fb7c690166e61856b0d2002a71ccdf10]]
#+begin_src emacs-lisp :tangle yes
(straight-use-package 'rg)
(require 'rg)
(rg-enable-default-bindings)
   #+end_src
** pair
#+begin_src emacs-lisp :tangle yes
  (straight-use-package  '(awesome-pair :type git 
                                        :host github 
                                        :repo "manateelazycat/awesome-pair"))
  (require 'awesome-pair)
  (dolist (hook (list
                 'c-mode-common-hook
                 'c-mode-hook
                 'c++-mode-hook
                 'java-mode-hook
                 'haskell-mode-hook
                 'emacs-lisp-mode-hook
                 'lisp-interaction-mode-hook
                 'lisp-mode-hook
                 'maxima-mode-hook
                 'ielm-mode-hook
                 'sh-mode-hook
                 'makefile-gmake-mode-hook
                 'php-mode-hook
                 'python-mode-hook
                 'js-mode-hook
                 'go-mode-hook
                 'qml-mode-hook
                 'jade-mode-hook
                 'css-mode-hook
                 'ruby-mode-hook
                 'coffee-mode-hook
                 'rust-mode-hook
                 'qmake-mode-hook
                 'lua-mode-hook
                 'swift-mode-hook
                 'minibuffer-inactive-mode-hook
                 ))
    (add-hook hook '(lambda () (awesome-pair-mode 1))))

  (define-key awesome-pair-mode-map (kbd "(") 'awesome-pair-open-round)
  (define-key awesome-pair-mode-map (kbd "[") 'awesome-pair-open-bracket)
  (define-key awesome-pair-mode-map (kbd "{") 'awesome-pair-open-curly)
  (define-key awesome-pair-mode-map (kbd ")") 'awesome-pair-close-round)
  (define-key awesome-pair-mode-map (kbd "]") 'awesome-pair-close-bracket)
  (define-key awesome-pair-mode-map (kbd "}") 'awesome-pair-close-curly)
  (define-key awesome-pair-mode-map (kbd "=") 'awesome-pair-equal)

  (define-key awesome-pair-mode-map (kbd "%") 'awesome-pair-match-paren)
  (define-key awesome-pair-mode-map (kbd "\"") 'awesome-pair-double-quote)

  (define-key awesome-pair-mode-map (kbd "SPC") 'awesome-pair-space)

  (define-key awesome-pair-mode-map (kbd "M-o") 'awesome-pair-backward-delete)
  (define-key awesome-pair-mode-map (kbd "C-d") 'awesome-pair-forward-delete)
  (define-key awesome-pair-mode-map (kbd "C-k") 'awesome-pair-kill)

  (define-key awesome-pair-mode-map (kbd "M-\"") 'awesome-pair-wrap-double-quote)
  (define-key awesome-pair-mode-map (kbd "M-[") 'awesome-pair-wrap-bracket)
  (define-key awesome-pair-mode-map (kbd "M-{") 'awesome-pair-wrap-curly)
  (define-key awesome-pair-mode-map (kbd "M-(") 'awesome-pair-wrap-round)
  (define-key awesome-pair-mode-map (kbd "M-)") 'awesome-pair-unwrap)

  (define-key awesome-pair-mode-map (kbd "M-p") 'awesome-pair-jump-right)
  (define-key awesome-pair-mode-map (kbd "M-n") 'awesome-pair-jump-left)
  (define-key awesome-pair-mode-map (kbd "M-:") 'awesome-pair-jump-out-pair-and-newline)
#+end_src
** [[https://github.com/cireu/fuz.el][cireu/fuz.el: Fast and precise fuzzy scoring/matching utils for Emacs, powered by rust]]
#+begin_src emacs-lisp :tangle yes
  ;; (use-package fuz
  ;; :load-path "./setup/fuz.el"
  ;; :config
  ;; (with-eval-after-load 'helm
  ;;   (require 'helm-fuz)
  ;;   (helm-fuz-mode))
  ;; (setq ivy-sort-matches-functions-alist '((t . ivy-fuz-sort-fn)))
  ;; (setq ivy-re-builders-alist '((t . ivy-fuz-regex-fuzzy)))

  ;; (with-eval-after-load 'ivy
  ;;   (require 'ivy-fuz)
  ;;   (add-to-list 'ivy-highlight-functions-alist '(ivy-fuz-regex-fuzzy . ivy-fuz-highlight-fn)))
  ;; )
#+end_src
** ☞ TODO discover.el
~M-s~

- [[https://github.com/Malabarba/elisp-bug-hunter/][Malabarba/elisp-bug-hunter: Hunt down errors in elisp files.]]
#+begin_src emacs-lisp :tangle yes
  (use-package discover
    :straight (discover :type git 
                        :host github 
                        :repo "mickeynp/discover.el")
    :config
    (global-discover-mode 1)


    )
    

#+end_src
** ✰ Important [[https://github.com/suryaaditya/emacs.d/blob/aa4b837921d63c2c6cbdb787cf753d94c4bdbe0a/elisp/init-neotree.el][emacs.d/init-neotree.el at aa4b837921d63c2c6cbdb787cf753d94c4bdbe0a · suryaaditya/emacs.d]]
** [[https://github.com/10sr/switch-buffer-functions-el][10sr/switch-buffer-functions-el: Hook Run When Switching Current Buffer]]
* Project management
** projectile
The commands are based on
http://endlessparentheses.com/improving-projectile-with-extra-commands.html?source=rss
   #+begin_src emacs-lisp :tangle yes

  (use-package projectile
    :straight t
    :config
    ;; Global configuration
    (setq projectile-switch-project-action 'neotree-projectile-action
          projectile-enable-caching t
          projectile-create-missing-test-files t
          projectile-switch-project-action #'projectile-commander
          projectile-ignored-project-function 'file-remote-p)

    ;; Defining some helpers
    (def-projectile-commander-method ?s
      "Open a *shell* buffer for the project."
      ;; This requires a snapshot version of Projectile.
      (projectile-run-shell))

    (def-projectile-commander-method ?c
      "Run `compile' in the project."
      (projectile-compile-project nil))

    (def-projectile-commander-method ?\C-?
      "Go back to project selection."
      (projectile-switch-project))

    ;; Keys
    (define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map)

    ;; Activate globally
    (projectile-mode)
)
   #+end_src
** ⚑ WAITING [[https://github.com/nyyManni/ejira][nyyManni/ejira: Emacs JIRA integration]]
* File/Directory management
** Dired-hydra
   #+begin_src emacs-lisp :tangle yes
(use-package dired
  :ensure nil
  :config
  (defhydra hydra-dired (:hint nil :color pink)

    "
    _+_ mkdir          _v_iew           _m_ark             _(_ details        _i_nsert-subdir    wdired
    _C_opy             _O_ view other   _U_nmark all       _)_ omit-mode      _$_ hide-subdir    C-x C-q : edit
    _D_elete           _o_pen other     _u_nmark           _l_ redisplay      _w_ kill-subdir    C-c C-c : commit
    _R_ename           _M_ chmod        _t_oggle           _g_ revert buf     _e_ ediff          C-c ESC : abort
    _Y_ rel symlink    _G_ chgrp        _E_xtension mark   _s_ort             _=_ pdiff
    _S_ymlink          ^ ^              _F_ind marked      _._ toggle hydra   \\ flyspell
    _r_sync            ^ ^              ^ ^                ^ ^                _?_ summary
    _z_ compress-file  _A_ find regexp
    _Z_ compress       _Q_ repl regexp

    T - tag prefix
    "
    ("\\" dired-do-ispell)
    ("(" dired-hide-details-mode)
    (")" dired-omit-mode)
    ("+" dired-create-directory)
    ("=" diredp-ediff)         ;; smart diff
    ("?" dired-summary)
    ("$" diredp-hide-subdir-nomove)
    ("A" dired-do-find-regexp)
    ("C" dired-do-copy)        ;; Copy all marked files
    ("D" dired-do-delete)
    ("E" dired-mark-extension)
    ("e" dired-ediff-files)
    ("F" dired-do-find-marked-files)
    ("G" dired-do-chgrp)
    ("g" revert-buffer)        ;; read all directories again (refresh)
    ("i" dired-maybe-insert-subdir)
    ("l" dired-do-redisplay)   ;; relist the marked or singel directory
    ("M" dired-do-chmod)
    ("m" dired-mark)
    ("O" dired-display-file)
    ("o" dired-find-file-other-window)
    ("Q" dired-do-find-regexp-and-replace)
    ("R" dired-do-rename)
    ("r" dired-do-rsynch)
    ("S" dired-do-symlink)
    ("s" dired-sort-toggle-or-edit)
    ("t" dired-toggle-marks)
    ("U" dired-unmark-all-marks)
    ("u" dired-unmark)
    ("v" dired-view-file)      ;; q to exit, s to search, = gets line #
    ("w" dired-kill-subdir)
    ("Y" dired-do-relsymlink)
    ("z" diredp-compress-this-file)
    ("Z" dired-do-compress)
    ("q" nil)
    ("." nil :color blue))


  :init
  (defun ora-ediff-files ()
    (interactive)
    (let ((files (dired-get-marked-files))
          (wnd (current-window-configuration)))
      (if (<= (length files) 2)
          (let ((file1 (car files))
                (file2 (if (cdr files)
                           (cadr files)
                         (read-file-name
                          "file: "
                          (dired-dwim-target-directory)))))
            (if (file-newer-than-file-p file1 file2)
                (ediff-files file2 file1)
              (ediff-files file1 file2))
            (add-hook 'ediff-after-quit-hook-internal
                      (lambda ()
                        (setq ediff-after-quit-hook-internal nil)
                        (set-window-configuration wnd))))
        (error "no more than 2 files should be marked"))))

  :config

  (setq-default dired-omit-files "^\\.[^.]+"
                dired-omit-mode t)

  ;; Adapt ls lisp format
  (if (boundp 'ls-lisp-ignore-case)
      (setq ls-lisp-ignore-case t))
  (if (boundp 'ls-lisp-dirs-first)
      (setq ls-lisp-dirs-first t))
  (if (boundp 'ls-lisp-use-localized-time-format)
      (setq ls-lisp-use-localized-time-format t))
  (if (boundp 'ls-lisp-format-time-list)
      (setq ls-lisp-format-time-list '("%Y-%m-%d %H:%M" "%Y-%m-%d %H:%M")))

  (put 'dired-find-alternate-file 'disabled nil)

  (setq auto-compression-mode t
        dired-details-hidden-string "[...]")

 ;; (let ((args (list "-aBhl" "--group-directories-first")))
 ;;    (when IS-BSD
 ;;      ;; Use GNU ls as `gls' from `coreutils' if available. Add `(setq
 ;;      ;; dired-use-ls-dired nil)' to your config to suppress the Dired warning
 ;;      ;; when not using GNU ls.
 ;;      (if-let* ((gls (executable-find "gls")))
 ;;          (setq insert-directory-program gls)
 ;;        ;; BSD ls doesn't support --group-directories-first
 ;;        (setq args (delete "--group-directories-first" args))))
 ;;    (setq dired-listing-switches (string-join args " ")))
  )
   #+end_src
** Dired-custom
   #+begin_src emacs-lisp :tangle yes
(use-package autorevert
  :straight f
  :diminish t
  :hook
  (dired-mode . auto-revert-mode)
  :config
  (global-auto-revert-mode +1)
  :custom
  (auto-revert-verbose nil))

;;Sort directories first
(setq dired-listing-switches "-aBhl  --group-directories-first")

;;Enable dired-dwim
;;This allows dired to copy/paste/move files over to the other directory in a separate window pane quickly.

(setq dired-dwim-target t)

;Recursive Copying and Deleting
(setq dired-recursive-copies (quote always))
(setq dired-recursive-deletes (quote top))

;;allow editing of permissions
(use-package wdired
  :commands wdired-mode wdired-change-to-wdired-mode
  :custom
  (wdired-allow-to-change-permissions t))

(use-package dired-narrow
  :bind (:map dired-mode-map
              ("N" . dired-narrow-fuzzy)))
(use-package dired-x
  :ensure nil
  :hook (dired-mode . dired-omit-mode)
  :config
  (setq dired-omit-verbose nil))


(use-package counsel-fd
:load-path "./setup")
   #+end_src


*** diredfl
    #+begin_src emacs-lisp :tangle yes
(use-package diredfl
:straight t
:hook (dired-mode . diredfl-mode))
    #+end_src
** Treemacs
   #+begin_src emacs-lisp :tangle yes
  (use-package treemacs
    :straight t
    :bind (:map global-map
                ([f8]        . treemacs-toggle))
    :config
    (setq treemacs-follow-after-init          t
          treemacs-width                      35
          treemacs-indentation                2
          treemacs-git-integration            t
          treemacs-collapse-dirs              3
          treemacs-silent-refresh             nil
          treemacs-change-root-without-asking nil
          treemacs-sorting                    'alphabetic-desc
          treemacs-show-hidden-files          t
          treemacs-never-persist              nil
          treemacs-is-never-other-window      nil
          treemacs-goto-tag-strategy          'refetch-index)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t))
   #+end_src
*** Magit
    #+begin_src emacs-lisp :tangle yes
 (use-package treemacs-magit
    :after treemacs magit
    :straight t)
    #+end_src
*** Projectile
    #+begin_src emacs-lisp :tangle yes
  (use-package treemacs-projectile
    :straight t
    :after treemacs projectile
    :config
    (setq treemacs-header-function #'treemacs-projectile-create-header))
    #+end_src
