dotfiles/emacs/emacs.d/setup/linux.el
;; (straight-use-package '(snails :type git
 ;;                                :host github
 ;;                                :repo "manateelazycat/snails"))
 ;;  (define-key snails-mode-map [remap next-line] #'snails-select-next-item)
(use-package snails
 :load-path "./setup/snails"
 :config
 (define-key snails-mode-map [remap next-line] #'snails-select-next-item)
 (add-hook 'snails-mode-hook #'xah-fly-insert-mode-activate)
 )
