dotfiles/emacs/emacs.d/setup/macos.el
(use-package snails
  :load-path "./setup/snails"
  :config
  (define-key snails-mode-map [remap next-line] #'snails-select-next-item)
  (add-hook 'snails-mode-hook #'xah-fly-insert-mode-activate)
  )
