dotfiles/emacs/emacs.d/init.org
*** Icons
 #+begin_src emacs-lisp :tangle yes
  (use-package treemacs-icons-dired
    :after treemacs dired
    :straight t
    :config (treemacs-icons-dired-mode))
 #+end_src

* Lang
** Language server
   - [[https://github.com/yanghaoxie/emacs.d-use-package-/blob/e43627c53039bba27dc13fc99e9310ca576b6ca2/lisp/init-lsp.el][emacs.d-use-package-/init-lsp.el at e43627c53039bba27dc13fc99e9310ca576b6ca2 · yanghaoxie/emacs.d-use-package-]]
   #+begin_src emacs-lisp :tangle yes
          (use-package lsp-mode
            :straight t
            :commands lsp
            :hook
            (lsp-after-open-hook . lsp-enable-imenu)
            :custom
            (lsp-message-project-root-warning t)
            :init
            (require 'lsp-clients)
            (add-hook 'python-mode-hook #'lsp)
            (add-hook 'c++-mode-hook #'lsp)
            (add-hook 'c-mode-hook #'lsp)
            (add-hook 'go-mode-hook #'lsp)
            :config
            (setq lsp-auto-guess-root t)
            (setq lsp-enable-eldoc t)
            (setq lsp-enable-completion-at-point t))

          (use-package lsp-ui
            :straight t
            :after lsp-mode
            :commands lsp-ui-mode
            :hook
            (lsp-mode . lsp-ui-mode)
            :config
            (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
            (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
            :bind
            (:map lsp-ui-peek-mode-map
                  ("h" . lsp-ui-peek--select-prev-file)
                  ("j" . lsp-ui-peek--select-next)
                  ("k" . lsp-ui-peek--select-prev)
                  ("l" . lsp-ui-peek--select-next-file)
                  :map lsp-ui-imenu-mode-map
                  ("h" . lsp-ui-imenu--jump)
                  ("j" . lsp-ui-imenu--visit)
                  ("l" . lsp-ui-imenu--view))

            )

          ;; (use-package company-lsp
          ;;   :straight t
          ;;   :after company lsp-mode latex-mode
          ;;   :config
          ;;   (add-to-list 'company-backends 'company-lsp)
          ;; )


          ;; (use-package lsp-treemacs
          ;;   :straight (lsp-treemacs :type git :host github :repo "emacs-lsp/lsp-treemacs")
          ;;   :commands lsp-treemacs-errors-list)
     (straight-use-package 'lsp-treemacs)


   #+end_src
** ☕ BREAK Debug(Dap-mode)
CLOSED: [2019-08-08 Thu 14:56]
- [[https://github.com/emacs-lsp/dap-mode][emacs-lsp/dap-mode: Emacs Debug Adapter Protocol]]
#+begin_src emacs-lisp :tangle yes
  ;; (use-package dap-mode
  ;; :straight t
  ;; :after lsp
  ;; :config
  ;; (dap-mode 1)
  ;; (dap-ui-mode 1)
  ;; (require 'dap-python)
  ;; (require 'dap-go)
  ;; )

#+end_src
** Lisp
*** Emacs Lisp
   #+begin_src emacs-lisp :tangle yes
     (straight-use-package 'package-lint)

     ;; Pretty print for lisp
     (straight-use-package 'ipretty)

     (straight-use-package 'anaphora)
     (require 'anaphora)

   #+end_src
*** [[https://github.com/alphapapa/prism.el][alphapapa/prism.el: Highlight Lisp forms according to depth]]
#+begin_src emacs-lisp :tangle yes
   (straight-use-package '(prism :type git
                                 :host github
                                 :repo "alphapapa/prism.el"))
(require 'prism)
(require 'solarized-theme)
(prism-set-faces :num 24
  :desaturations (list 20 40) :lightens (list 0 20 40)
  :colors (solarized-with-color-variables 'dark
	    (list red orange yellow green blue cyan violet magenta)))
#+end_src
*** Common lisp
#+begin_src emacs-lisp :tangle yes
(use-package slime
:straight t
:config
(setq inferior-lisp-program "/usr/local/bin/sbcl")
(setq slime-contribs '(slime-fancy)))
#+end_src
*** [[https://github.com/DogLooksGood/parinfer-mode][DogLooksGood/parinfer-mode: Parinfer for Emacs :)]]
** R
- [[https://www.r-bloggers.com/using-r-with-emacs-and-ess/][Using R with Emacs and ESS | R-bloggers]]
- [[http://ess.r-project.org/Manual/ess.html#Installation][ESS – Emacs Speaks Statistics]]
- [[https://github.com/oracleyue/dotfiles/blob/6bc5e32698bdb5aee9aa394ed97dd0f235f01a14/_emacs.d/init/init-r.el][dotfiles/init-r.el at 6bc5e32698bdb5aee9aa394ed97dd0f235f01a14 · oracleyue/dotfiles]]
- [[https://github.com/mattfidler/kicker/blob/8c6bd7f4bcd6bd07c7fa7217d613b849eab39c87/pkg-init/init-ess.org][kicker/init-ess.org at 8c6bd7f4bcd6bd07c7fa7217d613b849eab39c87 · mattfidler/kicker]]
#+begin_src emacs-lisp :tangle yes
  (straight-use-package 'ess)
    ;;(require 'ess-site)
  (require 'ess-r-mode)
  (when (not (boundp 'ess-r-mode-hook))
    (setq ess-r-mode-hook nil ))
  (defun emacsmate-turn-on-ess-eldoc ()
    (require 'ess-eldoc))
  (add-hook 'ess-r-mode-hook 'emacsmate-turn-on-ess-eldoc)
  (autoload 'R-mode "ess-site" "ESS" 't)

  (add-to-list 'auto-mode-alist '("\\.[rR]\\'" . ess-r-mode))

      (defun gtrun/add-company-backend-ess ()
        (pop company-backends)
        (setq-local company-backends
                    (append '((company-R-args company-R-objects company-R-library
                                              company-tabnine))
                            company-backends)))

      (add-hook 'ess-r-mode-hook 'gtrun/add-company-backend-ess)

   ;; (require 'ess-r-mode)
      ;; (straight-use-package 'ess)
      ;; (require 'ess)
      (straight-use-package 'ess-R-data-view)
      (require 'ess-R-data-view)
#+end_src
** Go
*** default
   #+begin_src emacs-lisp :tangle yes
(use-package go-mode
:straight t
:config
(autoload 'go-mode "go-mode" nil t)
(add-to-list 'auto-mode-alist '("\\.go\\'" . go-mode)))
   #+end_src
*** [[https://github.com/pope/ob-go][pope/ob-go: Org-Babel support for evaluating go code.]]
** Python
*** default
#+begin_src emacs-lisp :tangle yes
    (use-package python
    :ensure nil
    :config

  (add-hook 'python-mode-hook 
        (lambda () 
          (unless (eq buffer-file-name nil) (flymake-mode 1)) ;dont invoke flymake on temporary buffers for the interpreter
          (flycheck-mode 1)
          (outline-minor-mode -1)))

    )
#+end_src
*** lsp-python 
#+begin_src emacs-lisp :tangle yes
      (use-package lsp-python-ms
        :straight t
        :demand t
        :hook (python-mode . lsp))


#+end_src
#+begin_src emacs-lisp :tangle "./setup/macos.el"
(setq lsp-python-ms-executable
      "~/src/python-language-server/output/bin/Release/osx-x64/publish/Microsoft.Python.LanguageServer")
#+end_src
#+begin_src emacs-lisp :tangle "./setup/linux.el"
(setq lsp-python-ms-executable
      "~/src/python-language-server/output/bin/Release/linux-x64/publish/Microsoft.Python.LanguageServer")
#+end_src

*** [[https://github.com/dzop/emacs-jupyter][dzop/emacs-jupyter: An interface to communicate with Jupyter kernels.]]
** Latex
*** Acutex
- [[https://www.emacswiki.org/emacs/AUCTeX][EmacsWiki: AUCTe X]]
#+begin_src emacs-lisp :tangle yes


  (use-package tex-site
    :ensure nil
    :after (tex latex)
    :hook
    (LaTeX-mode . turn-off-auto-fill)
    (LaTeX-mode . (lambda () (TeX-fold-mode t)))
    (LaTeX-mode . flyspell-mode)
    (LaTeX-mode . LaTeX-math-mode)
    (LaTeX-mode . outline-minor-mode)
    (LaTeX-mode . TeX-source-correlate-mode)
    :config
    ;; Pdf activated by default
    (require 'tex)

    ;; Diverse
    (setq-default TeX-master nil)
    (setq TeX-parse-self t
          TeX-auto-save t)
    )


  (defun my-latex-mode-setup ()
    (setq-local company-backends
                (append '((company-math-symbols-latex company-latex-commands))
                        company-backends)))

  (add-hook 'TeX-mode-hook 'my-latex-mode-setup)
  (setq tex-compile-commands '(("xelatex %r")))
  (setq tex-command "xelatex")
  (setq org-latex-compiler "xelatex")

  (setq-default TeX-engine 'xetex)
  (setq-default TeX-PDF-mode t)

#+end_src
**** chinese-latex
#+begin_src emacs-lisp :tangle yes

(require 'ox-latex)
  (add-to-list 'org-latex-classes '("ctexart" "\\documentclass[11pt]{ctexart}

  [NO-DEFAULT-PACKAGES]
    \\usepackage[utf8]{inputenc}
    \\usepackage[T1]{fontenc}
    \\usepackage{fixltx2e}
    \\usepackage{graphicx}
    \\usepackage{longtable}
    \\usepackage{float}
    \\usepackage{wrapfig}
    \\usepackage{rotating}
    \\usepackage[normalem]{ulem}
    \\usepackage{amsmath}
    \\usepackage{textcomp}
    \\usepackage{marvosym}
    \\usepackage{wasysym}
    \\usepackage{amssymb}
    \\usepackage{booktabs}
    \\usepackage[colorlinks,linkcolor=black,anchorcolor=black,citecolor=black]{hyperref}
    \\tolerance=1000
    \\usepackage{listings}
    \\usepackage{xcolor}
    \\lstset{
    %行号
    numbers=left,
    %背景框
    framexleftmargin=10mm,
    frame=none,
    %背景色
    %backgroundcolor=\\color[rgb]{1,1,0.76},
    backgroundcolor=\\color[RGB]{245,245,244},
    %样式
    keywordstyle=\\bf\\color{blue},
    identifierstyle=\\bf,
    numberstyle=\\color[RGB]{0,192,192},
    commentstyle=\\it\\color[RGB]{0,96,96},
    stringstyle=\\rmfamily\\slshape\\color[RGB]{128,0,0},
    %显示空格
    showstringspaces=false
    }
    "
                                            ("\\section{%s}" . "\\section*{%s}")
                                            ("\\subsection{%s}" . "\\subsection*{%s}")
                                            ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                                            ("\\paragraph{%s}" . "\\paragraph*{%s}")
                                            ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

          ;; {{ export org-mode in Chinese into PDF
          ;; @see http://freizl.github.io/posts/tech/2012-04-06-export-orgmode-file-in-Chinese.html
          ;; and you need install texlive-xetex on different platforms
          ;; To install texlive-xetex:
          ;;    `sudo USE="cjk" emerge texlive-xetex` on Gentoo Linux
          ;; }}
          (setq org-latex-default-class "ctexart")
          (setq org-latex-pdf-process
                '(
                  "xelatex -interaction nonstopmode -output-directory %o %f"
                  "xelatex -interaction nonstopmode -output-directory %o %f"
                  "xelatex -interaction nonstopmode -output-directory %o %f"
                  "rm -fr %b.out %b.log %b.tex auto"))
#+end_src
**** Build

# - Macos
# #+begin_src sh :tangle yes
#   ./configure --with-lispdir=/Applications/Emacs.app/Contents/Resources/site-lisp --with-texmf-dir=/usr/local/texlive/texmf-local # 
# #+end_src
*** [[https://github.com/vspinu/company-math/tree/600e49449644f6835f9dc3501bc58461999e8ab9][vspinu/company-math at 600e49449644f6835f9dc3501bc58461999e8ab9]]
#+begin_src emacs-lisp :tangle yes
(use-package company-math
:straight t
:hook
  (latex-mode . (lambda () (add-to-list (make-local-variable 'company-backends) '(company-math-symbols-unicode))))
  (org-mode . (lambda () (add-to-list (make-local-variable 'company-backends) '(company-math-symbols-unicode))))
)


#+end_src
*** ⚑ WAITING [[https://github.com/johnbcoughlin/calctex][johnbcoughlin/calctex]]

** NixOS
*** default
    - [[https://github.com/travisbhartwell/nix-emacs/tree/45c8d90748304c90e1503c9fa8db0443f3d4bd89][travisbhartwell/nix-emacs at 45c8d90748304c90e1503c9fa8db0443f3d4bd89]]
    #+begin_src emacs-lisp :tangle "./setup/linux.el"
(use-package nix-mode
  :straight t
  :config
  (add-to-list 'auto-mode-alist '("\\.nix\\'" . nix-mode))

)
(use-package company-nixos-options
  :straight t
  :after nix-mode
  :config
  (defun my-nix-mode-setup ()
    (setq-local company-backends
                (append '((company-nixos-options company-files company-tabnine company-yasnippet ))
                        company-backends)))

  (add-hook 'nix-mode-hook 'my-nix-mode-setup))
    #+end_src
*** ⚑ WAITING [[https://github.com/matthewbauer/bauer][matthewbauer/bauer: An Emacs+Nix IDE]]
** bro-mode
#+begin_src emacs-lisp :tangle yes
  (use-package bro-mode
    :load-path "./setup"
    :config
    (setenv "BROPATH" "/usr/local/zeek/bin:/usr/local/zeek/share/zeek")
    (setq bro-event-bif "/usr/local/zeek/share/zeek/base/bif/event.bif.zeek")
    (setq bro-tracefiles "~/project/Bro-Script")
    :bind
    (:map bro-mode-map
          ("C-c C-c" . bro-run)))
#+end_src
** Json
*** [[https://github.com/SavchenkoValeriy/jeison][SavchenkoValeriy/jeison: An Emacs library for declarative JSON parsing]]
#+begin_src emacs-lisp :tangle yes
(straight-use-package 'jeison)
#+end_src
** ⚔ STARTED [[https://github.com/karlotness/tree-sitter.el][karlotness/tree-sitter.el: An Emacs dynamic module exposing tree-sitter.]]
CLOSED: [2019-07-25 Thu 19:55]
*** [[https://github.com/ubolonton/emacs-tree-sitter][ubolonton/emacs-tree-sitter: Emacs Lisp binding and tooling for tree-sitter]]
*** Macos
first of all, you shoud use PATH ~gcc~ make dist:

if you got an issue like this:

/ld: symbol(s) not found for architecture x86_64
clang: error: linker command failed with exit code 1/

change ~CC~ PATH ~gcc~ to ~clang++~  

/Do Not make clean/, just changed path to make dist


#+begin_src emacs-lisp :tangle "./setup/macos.el"
  (use-package tree-sitter
  :load-path "~/project/emacs/tree-sitter.el/tree-sitter-0.0.3"
  :load-path "~/project/emacs/tree-sitter.el/langs/python"
  :load-path "~/project/emacs/tree-sitter.el/langs/go"
  :config
  (require 'tree-sitter)
  (require 'tree-sitter-live)
  (require 'tree-sitter-live-preview)
  (require 'tree-sitter-lang-python)
  (require 'tree-sitter-lang-go)


  (setq tree-sitter-live-auto-alist
        '((go-mode . tree-sitter-lang-go)
          (python-mode . tree-sitter-lang-python)))
  (global-tree-sitter-live-mode t)

  )
#+end_src

#+RESULTS:
: t



  
#+end_src

* Better Setting (doom-emacs & spacemacs)
** vinegar(spacemacs)
#+begin_src emacs-lisp :tangle yes
(use-package space-vinegar
:load-path ("./setup"))
#+end_src
* Org-mode
** Global
#+begin_src emacs-lisp :tangle yes

    (straight-use-package 'git)

    (defun org-git-version ()
      "The Git version of org-mode.
    Inserted by installing org-mode or when a release is made."
      (require 'git)
      (let ((git-repo (expand-file-name
                       "straight/repos/org/" user-emacs-directory)))
        (string-trim
         (git-run "describe"
                  "--match=release\*"
                  "--abbrev=6"
                  "HEAD"))))

    (defun org-release ()
      "The release version of org-mode.
    Inserted by installing org-mode or when a release is made."
      (require 'git)
      (let ((git-repo (expand-file-name
                       "straight/repos/org/" user-emacs-directory)))
        (string-trim
         (string-remove-prefix
          "release_"
          (git-run "describe"
                   "--match=release\*"
                   "--abbrev=0"
                   "HEAD")))))
    (provide 'org-version)
#+end_src
