dotfiles/emacs/emacs.d/setup/linux.el

(setq lsp-python-ms-executable
      "~/src/python-language-server/output/bin/Release/linux-x64/publish/Microsoft.Python.LanguageServer")

(use-package nix-mode
  :straight t
  :config
  (add-to-list 'auto-mode-alist '("\\.nix\\'" . nix-mode))

)
(use-package company-nixos-options
  :straight t
  :after nix-mode
  :config
(add-to-list 'company-backends 'company-nixos-options))
