dotfiles/emacs/emacs.d/setup/macos.el

(setq lsp-python-ms-executable
      "~/src/python-language-server/output/bin/Release/osx-x64/publish/Microsoft.Python.LanguageServer")

(use-package tree-sitter
:load-path "~/project/emacs/tree-sitter.el/tree-sitter-0.0.3"
:load-path "~/project/emacs/tree-sitter.el/langs/python"
:load-path "~/project/emacs/tree-sitter.el/langs/go"
:config
(require 'tree-sitter)
(require 'tree-sitter-live)
(require 'tree-sitter-lang-python)
(require 'tree-sitter-lang-go)


(setq tree-sitter-live-auto-alist
      '((python-mode . tree-sitter-lang-python)))

(setq tree-sitter-live-auto-alist
      '((go-mode . tree-sitter-lang-go)))
(global-tree-sitter-live-mode t)
)
