dotfiles/emacs/emacs.d/init.org
** Hightlight org to HTML
- [[http://www.gonsie.com/blorg/org-highlight.html][Highlighting in Org-Mode]]
#+begin_src emacs-lisp :tangle yes
(require 'ox)
(defun my-html-mark-tag (text backend info)
  "Transcode :blah: into <mark>blah</mark> in body text."
  (when (org-export-derived-backend-p backend 'html)
    (let ((text (replace-regexp-in-string "[^\\w]\\(:\\)[^\n\t\r]+\\(:\\)[^\\w]" "<mark>"  text nil nil 1 nil)))
      (replace-regexp-in-string "[^\\w]\\(<mark>\\)[^\n\t\r]+\\(:\\)[^\\w]" "</mark>" text nil nil 2 nil))))

(add-to-list 'org-export-filter-plain-text-functions 'my-html-mark-tag)

(defun my-html-mark-tag (text backend info)
  "Transcode :blah: into <mark>blah</mark> in body text."
  (when (org-export-derived-backend-p backend 'html)
    (let ((text (replace-regexp-in-string "[^\\w]\\(:\\)[^\n\t\r]+\\(:\\)[^\\w]" "<mark>"  text nil nil 1 nil)))
      (replace-regexp-in-string "[^\\w]\\(<mark>\\)[^\n\t\r]+\\(:\\)[^\\w]" "</mark>" text nil nil 2 nil))))

(add-to-list 'org-export-filter-plain-text-functions 'my-html-mark-tag)
#+end_src
** org-publish-alish
#+begin_src emacs-lisp :tangle yes
(setq org-publish-project-alist
      '(("NSM"
	 :base-directory "~/org-notes/NSM-GTD"
	 :publishing-function org-html-publish-to-html
	 :publishing-directory "~/Dropbox/application/Bitcron/gtrun.bitcron.com/custom"
	 :include ["workflow.org"]
	 :exclude "Pattern.org"

	 )
	("init"
	 :base-directory "~/.emacs.d"
	 :publishing-function org-html-publish-to-html
	 :publishing-directory "~/Dropbox/application/Bitcron/gtrun.bitcron.com/custom"
	 :exclude "Pattern.org"
	 )
	("art"
	 :base-directory "~/org-notes/art"
	 :publishing-function org-html-publish-to-html
	 :publishing-directory "~/Dropbox/application/Bitcron/gtrun.bitcron.com/custom"
	 :exclude "Pattern.org"


	 )
	("course"
	 :base-directory "~/org-notes/course"
	 :publishing-function org-html-publish-to-html
	 :publishing-directory "~/Dropbox/application/Bitcron/gtrun.bitcron.com/custom"
	 :exclude "Pattern.org"
	 )
	))
#+end_src
** org-mode : Mp3 HTML
#+begin_src emacs-lisp :tangle yes
(org-add-link-type "audio" #'ignore #'endless/export-audio-link)

(defun endless/export-audio-link (path desc format)
  "Export org audio links to hmtl."
  (cl-case format
    (html (format
	   "<audio preload=\"auto\"> <source src=\"https://www.gtrun.org/music/%s\">%s</audio>"
	   path (or desc "")))

    ;; README: hugo music file path
    (md (format
	 "<audio class=\"wp-audio-shortcode\"  loop=\"1\"  preload=\"auto\" style=\"width: 100%%;\" controls> <source src=\"https://www.gtrun.org/music/%s\">%s</audio>"
	 path (or desc "")))
    (latex (format "(HOW DO I EXPORT AUDIO TO LATEX? \"%s\")" path))))
#+end_src
** emacs-htmlize
#+begin_src emacs-lisp :tangle yes
(straight-use-package 'htmlize)
(require 'htmlize)
#+end_src
** [[https://github.com/relevance/org-html-slideshow][relevance/org-html-slideshow: JavaScript presentation slides generated from Emacs org-mode]]
* Chinese
** [[https://github.com/redguardtoo/zhfreq][redguardtoo/zhfreq: processing chinese text using word frequency data]]
** [[https://github.com/tumashu/posframe/tree/fc90a1a558200e5c3688c65add9afdea695a2c10][tumashu/posframe at fc90a1a558200e5c3688c65add9afdea695a2c10]]
#+begin_src emacs-lisp :tangle yes
(straight-use-package 'posframe)
(require 'posframe)

#+end_src
** pyim
*** default
#+begin_src emacs-lisp :tangle yes
(straight-use-package 'pyim)
(require 'pyim)
(require 'pyim-basedict) ; 拼音词库设置，五笔用户 *不需要* 此行设置
(pyim-basedict-enable)   ; 拼音词库，五笔用户 *不需要* 此行设置
(setq default-input-method "pyim")
;; (setq pyim-default-scheme 'wubi)
;; (setq pyim-default-scheme 'quanpin)

;; 使用 pupup-el 来绘制选词框
(if (>= emacs-major-version 26)
    (setq pyim-page-tooltip 'child-frame)
  (setq pyim-page-tooltip 'popup))

;; 选词框显示 10 个候选词
(setq pyim-page-length 5)

(setq-default pyim-english-input-switch-functions
              '(pyim-probe-org-structure-template))

(setq-default pyim-punctuation-half-width-functions
              '(pyim-probe-punctuation-line-beginning
                pyim-probe-punctuation-after-punctuation))



(global-set-key (kbd "s-;") 'pyim-convert-string-at-point)
(define-key pyim-mode-map (kbd "<tab>") 'pyim-page-next-page)
(define-key pyim-mode-map (kbd "C-j") 'pyim-page-next-page)
(define-key pyim-mode-map (kbd "C-k") 'pyim-page-previous-page)
(define-key pyim-mode-map (kbd "<escape>") 'pyim-quit-clear)

;; (add-hook 'toggle-input-method #'xah-fly-insert-mode-activate)
(setq pyim-dicts
      `((:name "sougou-shiji" :file ,(expand-file-name "pyim/shiji.pyim" user-emacs-directory))
        (:name "sougou-shijin" :file ,(expand-file-name "pyim/shijin.pyim" user-emacs-directory))))

#+end_src
*** cnfont
- [[https://github.com/tumashu/cnfonts/issues/92][mode-line 字體機制分離 · Issue #92 · tumashu/cnfonts]]
#+begin_src emacs-lisp :tangle "./setup/macos.el"
      (use-package cnfonts
      :straight t
      :init
     (defun cnfonts--set-all-the-icons-fonts (&optional _)
        "Show icons in all-the-icons."
        (when (featurep 'all-the-icons)
          (dolist (charset '(kana han cjk-misc bopomofo gb18030))
            (set-fontset-font "fontset-default" charset "all-the-icons" nil 'append)
            (set-fontset-font "fontset-default" charset "github-octicons" nil 'append)
            (set-fontset-font "fontset-default" charset "FontAwesome" nil 'append)
            (set-fontset-font "fontset-default" charset "Material Icons" nil 'append)
            (set-fontset-font "fontset-default" charset "file-icons" nil 'append)
            (set-fontset-font "fontset-default" charset "Weather Icons" nil 'append))))
      :hook ((after-init . cnfonts-enable)
             (cnfonts-set-font-finish . cnfonts--set-all-the-icons-fonts))
      :config
    (setq cnfonts-use-cache t)
      (setq cnfonts-keep-frame-size nil)
      (add-hook 'window-setup-hook (lambda ()
                                     (setq cnfonts-keep-frame-size t)))
      ;; Set profiles
      (setq cnfonts-directory (concat no-littering-var-directory "cnfonts"))
      (setq cnfonts-profiles '("program1" "program2" "program3" "org-mode" "read-book"))
      (setq cnfonts--profiles-steps '(("program1" . 4)
                                      ("program2" . 5)
                                      ("program3" . 3)
                                      ("org-mode" . 6)
                                      ("read-book" . 8)))


    )

#+end_src

#+begin_src emacs-lisp :tangle "./setup/linux.el"
   (use-package cnfonts
    :straight t
    :hook ((after-init . cnfonts-enable))
    :config
  (setq cnfonts-use-cache t)
    (setq cnfonts-keep-frame-size nil)
    (add-hook 'window-setup-hook (lambda ()
                                   (setq cnfonts-keep-frame-size t)))
    ;; Set profiles
    (setq cnfonts-directory (concat no-littering-var-directory "cnfonts"))
    (setq cnfonts-profiles '("program1" "program2" "program3" "org-mode" "read-book"))
    (setq cnfonts--profiles-steps '(("program1" . 4)
                                    ("program2" . 5)
                                    ("program3" . 3)
                                    ("org-mode" . 6)
                                    ("read-book" . 8)))
)

#+end_src
**** Macos
#+begin_src emacs-lisp :tangle "./setup/macos.el"
  (set-face-attribute
      'default nil
      :font (font-spec :name "-*-Fantasque Sans Mono-normal-normal-normal-*-*-*-*-*-m-0-iso10646-1"
                       :weight 'normal
                       :slant 'normal
                       :size 24.0))
     (dolist (charset '(kana han symbol cjk-misc bopomofo))
       (set-fontset-font
        (frame-parameter nil 'font)
        charset
        (font-spec :name "-*-STFangsong-normal-normal-normal-*-*-*-*-*-p-0-iso10646-1"
                   :weight 'normal
                   :slant 'normal
                   :size 24.5)))



#+END_SRC
**** linux-font
#+begin_src emacs-lisp :tangle "./setup/linux.el"

(set-face-attribute
 'default nil
 :font (font-spec :name "-PfEd-Fantasque Sans Mono-normal-italic-normal-*-*-*-*-*-m-0-iso10646-1"
                  :weight 'normal
                  :slant 'normal
                  :size 16.0))
(dolist (charset '(kana han symbol cjk-misc bopomofo))
  (set-fontset-font
   (frame-parameter nil 'font)
   charset
   (font-spec :name "-ADBO-Source Han Sans CN-normal-normal-normal-*-*-*-*-*-*-0-iso10646-1"
              :weight 'normal
              :slant 'normal
              :size 20.5)))
 

#+END_SRC
*** [[https://blog.slegetank.com/blog/20190331-emacschinese.html][emacs 内置中文输入法]] 
*** ✔ DONE TO-> setup/macos.el
CLOSED: [2019-07-24 Wed 18:18]
- State "✔ DONE"     from              [2019-07-24 Wed 18:18]

** [[https://github.com/cute-jumper/ace-pinyin/tree/4915b2413359d85002918e322dbc90c4984b4277/screencasts][ace-pinyin/screencasts at 4915b2413359d85002918e322dbc90c4984b4277 · cute-jumper/ace-pinyin]]

#+begin_src emacs-lisp :tangle yes
(use-package ace-pinyin
:straight t
:config
(setq ace-pinyin-simplified-chinese-only-p nil)
(setq ace-pinyin-use-avy t)
(ace-pinyin-global-mode +1)
)
#+end_src
** [[https://github.com/coldnew/pangu-spacing/tree/3a741c1b669c7194fb766b784c10d52a8de9b87f][coldnew/pangu-spacing at 3a741c1b669c7194fb766b784c10d52a8de9b87f]]
e
#+begin_src emacs-lisp :tangle yes
  (use-package pangu-spacing
    :straight t
    :config
    (global-pangu-spacing-mode 1)
    (add-hook 'org-mode-hook
              '(lambda ()
                 (set (make-local-variable 'pangu-spacing-real-insert-separtor) t))))
#+end_src
** [[https://github.com/cute-jumper/pinyinlib.el/tree/45f05d3dbb4fe957f7ab332ca6f94675848b6aa3][cute-jumper/pinyinlib.el at 45f05d3dbb4fe957f7ab332ca6f94675848b6aa3]]
#+begin_src emacs-lisp :tangle yes
    (straight-use-package 'pinyinlib)
    (require 'pinyinlib)

    (defun re-builder-extended-pattern (str)
      (let* ((len (length str)))
        (cond
         ;; do nothing
         ((<= (length str) 0))

         ;; If the first charater of input in ivy is ":",
         ;; remaining input is converted into Chinese pinyin regex.
         ((string= (substring str 0 1) ":")
          (setq str (pinyinlib-build-regexp-string (substring str 1 len) t)))

         ;; If the first charater of input in ivy is "/",
         ;; remaining input is converted to pattrn to search camel case word
         ((string= (substring str 0 1) "/")
          (let* ((rlt "")
                 (i 0)
                 (subs (substring str 1 len))
                 c)
            (when (> len 2)
              (setq subs (upcase subs))
              (while (< i (length subs))
                (setq c (elt subs i))
                (setq rlt (concat rlt (cond
                                       ((and (< c ?a) (> c ?z) (< c ?A) (> c ?Z))
                                        (format "%c" c))
                                       (t
                                        (concat (if (= i 0) (format "[%c%c]" (+ c 32) c)
                                                  (format "%c" c))
                                                "[a-z]+")))))
                (setq i (1+ i))))
            (setq str rlt))))
        (ivy--regex-plus str)))


    (eval-after-load 'ivy 
      '(progn
         ;; better performance on everything (especially windows), ivy-0.10.0 required
         ;; @see https://github.com/abo-abo/swiper/issues/1218
         (setq ivy-dynamic-exhibit-delay-ms 250)

         ;; Press C-p and Enter to select current input as candidate
         ;; https://oremacs.com/2017/11/30/ivy-0.10.0/
         (setq ivy-use-selectable-prompt t)

         (setq ivy-re-builders-alist
               '((t . re-builder-extended-pattern)))
         ;; set actions when running C-x b
         ;; replace "frame" with window to open in new window
         (ivy-set-actions
          'ivy-switch-buffer-by-pinyin
          '(("j" switch-to-buffer-other-frame "other frame")
            ("k" kill-buffer "kill")
            ("r" ivy--rename-buffer-action "rename")))))
  (with-eval-after-load "swiper-isearch"
   (setq ivy-re-builders-alist
          '((t . re-builder-extended-pattern)
            (t . ivy-prescient-re-builder))))

#+end_src
* Eshell
- [[https://caiorss.github.io/Emacs-Elisp-Programming/Eshell.html][Eshell]]
** global
#+begin_src emacs-lisp :tangle yes
  (use-package eshell
    :ensure nil
    :hook
    (eshell-mode . (lambda () (eshell/export "NODE_NO_READLINE=1")))
    (eshell-exit . (lambda () (setq esh-prompt-num 0)))

    :config

    ;; If I ever want my own eshell/foo commands overwrite real commands ...
    (setq eshell-prefer-lisp-functions t)
    (add-to-list 'eshell-modules-list 'eshell-tramp)

    (setq eshell-prefer-lisp-variables t)

    (setq password-cache t) ; enable password caching
    (setq password-cache-expiry 3600) ; for one hour (time in secs)


    (defun clipboard/set (astring)
      "Copy a string to clipboard"
      (with-temp-buffer
        (insert astring)
        (clipboard-kill-region (point-min) (point-max))))

    (defun eshell/copy-pwd ()
      "Copy current directory to clipboard "
      (clipboard/set (eshell/pwd)))

    (defun eshell/copy-fpath (fname)
      "Copy file name with full path to clipboard "
      (let ((fpath (concat (eshell/pwd) "/" fname)))
        (clipboard/set fpath)
        (concat "Copied path: " fpath)))
    )
#+end_src
** awesome-shell
   - [[https://github.com/manateelazycat/aweshell][manateelazycat/aweshell: Awesome shell extension base on eshell with wonderful features!]]
   #+begin_src emacs-lisp :tangle yes
(straight-use-package '(aweshell
                        :type git
                        :host github
                        :repo "manateelazycat/aweshell"))
(require 'aweshell)
   #+end_src
* Version control
