dotfiles/emacs/emacs.d/setup/macos.el
      (font-spec :name "-*-STFangsong-normal-normal-normal-*-*-*-*-*-p-0-iso10646-1"
                 :weight 'normal
                 :slant 'normal
                 :size 24.5)))
