dotfiles/emacs/emacs.d/init.org
** Magit

   #+begin_src emacs-lisp :tangle yes
(use-package magit
  :straight t;(magit :type git :host github :repo "magit/magit")
  :commands (magit)
 ; :hook
 ; (magit-mode . (lambda () (local-set-key (kbd "o") 'magit-open-repo)))

  :config

  ;; Ignore recent commit
  (setq magit-status-sections-hook
        '(magit-insert-status-headers
          magit-insert-merge-log
          magit-insert-rebase-sequence
          magit-insert-am-sequence
          magit-insert-sequencer-sequence
          magit-insert-bisect-output
          magit-insert-bisect-rest
          magit-insert-bisect-log
          magit-insert-untracked-files
          magit-insert-unstaged-changes
          magit-insert-staged-changes
          magit-insert-stashes
          magit-insert-unpulled-from-upstream
          magit-insert-unpulled-from-pushremote
          magit-insert-unpushed-to-upstream
          magit-insert-unpushed-to-pushremote))


  ;; Update visualization
  (setq pretty-magit-alist nil
        pretty-magit-prompt nil)

  (defmacro pretty-magit (WORD ICON PROPS &optional NO-PROMPT?)
    "Replace sanitized WORD with ICON, PROPS and by default add to prompts."
    `(prog1
         (add-to-list 'pretty-magit-alist
                      (list (rx bow (group ,WORD (eval (if ,NO-PROMPT? "" ":"))))
                            ,ICON ',PROPS))
       (unless ,NO-PROMPT?
         (add-to-list 'pretty-magit-prompt (concat ,WORD ": ")))))

  ;; Operations
  (pretty-magit "add"   ? (:foreground "#375E97" :height 1.2) pretty-magit-prompt)
  (pretty-magit "fix"   ? (:foreground "#FB6542" :height 1.2) pretty-magit-prompt)
  (pretty-magit "clean" ? (:foreground "#FFBB00" :height 1.2) pretty-magit-prompt)
  (pretty-magit "doc."  ? (:foreground "#3F681C" :height 1.2) pretty-magit-prompt)

  ;; Meta information
  (pretty-magit "master"  ? (:box nil :height 1.2) t)
  (pretty-magit "origin"  ? (:box nil :height 1.2) t)
  (pretty-magit "upstream"  ? (:box nil :height 1.2) t)

  (defun add-magit-faces ()
    "Add face properties and compose symbols for buffer from pretty-magit."
    (interactive)
    (with-silent-modifications
      (--each pretty-magit-alist
        (-let (((rgx icon props) it))
          (save-excursion
            (goto-char (point-min))
            (while (search-forward-regexp rgx nil t)
              (compose-region
               (match-beginning 1) (match-end 1) icon)
              (when props
                (add-face-text-property
                 (match-beginning 1) (match-end 1) props))))))))

  (advice-add 'magit-status :after 'add-magit-faces)
  (advice-add 'magit-refresh-buffer :after 'add-magit-faces)


  ;; Opening repo externally
  (defun parse-url (url)
    "convert a git remote location as a HTTP URL"
    (if (string-match "^http" url)
        url
      (replace-regexp-in-string "\\(.*\\)@\\(.*\\):\\(.*\\)\\(\\.git?\\)"
                                "https://\\2/\\3"
                                url)))
  (defun magit-open-repo ()
    "open remote repo URL"
    (interactive)
    (let ((url (magit-get "remote" "origin" "url")))
      (progn
        (browse-url (parse-url url))
        (message "opening repo %s" url))))

  (setq magit-display-buffer-function #'+magit-display-buffer)
  (defun +magit-display-buffer (buffer)
    "Marries `magit-display-buffer-fullcolumn-most-v1' with
`magit-display-buffer-same-window-except-diff-v1', except:

1. Magit sub-buffers that aren't spawned from a status screen are opened as
   popups.
2. The status screen isn't buried when viewing diffs or logs from the status
   screen."
    (let ((buffer-mode (buffer-local-value 'major-mode buffer)))
      (display-buffer
       buffer (cond
               ;; If opened from an eshell window or popup, use the same window.
               ((or (derived-mode-p 'eshell-mode)
                    (eq (window-dedicated-p) 'side))
                '(display-buffer-same-window))
               ;; Open target buffers below the current one (we want previous
               ;; magit windows to be visible; especially magit-status).
               ((or (bound-and-true-p git-commit-mode)
                    (derived-mode-p 'magit-mode))
                (let ((size (if (eq buffer-mode 'magit-process-mode)
                                0.35
                              0.7)))
                  `(display-buffer-below-selected
                    . ((window-height . ,(truncate (* (window-height) size)))))))
               ;; log/stash/process buffers, unless opened from a magit-status
               ;; window, should be opened in popups.
               ((memq buffer-mode '(magit-process-mode
                                    magit-log-mode
                                    magit-stash-mode))
                '(display-buffer-below-selected))
               ;; Last resort: use current window
               ('(display-buffer-same-window))))))


(defun magit-remove-git-lock-file ()
  "Remove git's index lock file, if it exists."
  (interactive)
  (let ((base (magit-toplevel)))
    (delete-file (concat base "/.git/index.lock"))))

  )

   #+end_src
** Magit-todos
- [[https://github.com/alphapapa/magit-todos/tree/8f634a29cbd1f2b7cd7f3f62c96f14437327f29b#installation][alphapapa/magit-todos at 8f634a29cbd1f2b7cd7f3f62c96f14437327f29b]]
#+begin_src emacs-lisp :tangle yes
      (use-package magit-todos
      :straight t
      :after magit
      :hook
      (magit-mode . magit-todos-mode)
      :config
      (setq magit-todos-exclude-globs '("nixpkgs/*"))
      )
#+end_src
** Magithub

 #+begin_src emacs-lisp :tangle yes

  (use-package magithub
    :straight t
    :after (:all magit)
    :config
    (magithub-feature-autoinject t)
    (setq magithub-github-hosts '("github.enterprise.domain/api/v3"))
    (setq magithub-clone-default-directory "~/tmp"))

 #+end_src
* View
** W3m
#+begin_src emacs-lisp :tangle yes
  (straight-use-package 'w3m)
  (require 'w3m)

#+end_src

* Documentation
** help
   #+begin_src emacs-lisp :tangle yes
   (use-package helpful
     :straight t
     )
   #+end_src
** Info
   #+begin_src emacs-lisp :tangle yes
(use-package info-buffer
  :straight t
)
(use-package info+
  :straight t
  :disabled t)
   #+end_src

* Hydra-Keys/shortcuts
** Project/Version control
#+begin_src emacs-lisp :tangle yes
  (defhydra hydra-projectile-other-window (:color teal)
    "projectile-other-window"
    ("f"  projectile-find-file-other-window        "file")
    ("g"  projectile-find-file-dwim-other-window   "file dwim")
    ("d"  projectile-find-dir-other-window         "dir")
    ("b"  projectile-switch-to-buffer-other-window "buffer")
    ("q"  nil                                      "cancel" :color blue))

  (defhydra hydra-projectile (:color teal :hint nil)
    "
       PROJECTILE: %(projectile-project-root)

       Find File            Search/Tags          Buffers                Cache
  ------------------------------------------------------------------------------------------
  _s-f_: file            _a_: ag                _i_: Ibuffer           _c_: cache clear
   _ff_: file dwim       _g_: update gtags      _b_: switch to buffer  _x_: remove known project
   _fd_: file curr dir   _o_: multi-occur     _s-k_: Kill all buffers  _X_: cleanup non-existing
    _r_: recent file                                               ^^^^_z_: cache current
    _d_: dir

  "
    ("<ESC>" nil "quit")
    ("<" hydra-project/body "back")
    ("a"   projectile-ag)
    ("b"   projectile-switch-to-buffer)
    ("c"   projectile-invalidate-cache)
    ("d"   projectile-find-dir)
    ("s-f" projectile-find-file)
    ("ff"  projectile-find-file-dwim)
    ("fd"  projectile-find-file-in-directory)
    ("g"   ggtags-update-tags)
    ("s-g" ggtags-update-tags)
    ("i"   projectile-ibuffer)
    ("K"   projectile-kill-buffers)
    ("s-k" projectile-kill-buffers)
    ("m"   projectile-multi-occur)
    ("o"   projectile-multi-occur)
    ("s-p" projectile-switch-project "switch project")
    ("p"   projectile-switch-project)
    ("s"   projectile-switch-project)
    ("r"   projectile-recentf)
    ("x"   projectile-remove-known-project)
    ("X"   projectile-cleanup-known-projects)
    ("z"   projectile-cache-current-file)
    ("`"   hydra-projectile-other-window/body "other window" :color blue)
    ("q"   nil "cancel" :color blue))

  (defhydra hydra-magit (:color teal :hint nil)
    "
        Magit: %(magit-get \"remote\" \"origin\" \"url\")

   Status/Info      Remote          Operations
  ------------------------------------------------------------------------------------------
  _s_: Status      _f_: Pull       _c_: commit
  _l_: Log all     _p_: Push
  _d_: Diff
  _t_: timeline
  "
    ("<ESC>" nil "quit")
    ("<" hydra-project/body "back")
    ("f" magit-pull-branch)
    ("p" magit-push-other)
    ("c" magit-commit-create)
    ("d" magit-diff-range)
    ("l" magit-log-all)
    ("s" magit-status)
    ("t" git-timeline)
    ("q"   nil "cancel" :color blue))

  (defhydra hydra-flycheck (:pre (progn (setq hydra-lv t) (flycheck-list-errors))
                                 :post (progn (setq hydra-lv nil) (quit-windows-on "*Flycheck errors*"))
                                 :color teal
                                 :hint nil)
    "Errors"
    ("f"  flycheck-error-list-set-filter                            "Filter")
    ("j"  flycheck-next-error                                       "Next")
    ("k"  flycheck-previous-error                                   "Previous")
    ("gg" flycheck-first-error                                      "First")
    ("G"  (progn (goto-char (point-max)) (flycheck-previous-error)) "Last")
    ("<" hydra-project/body "back")
    ("q"   nil "cancel" :color blue))


  (defhydra hydra-project (:color teal :hint nil)
    "
       Project/Source management

   Projects              Version control        On-the-fly
  ------------------------------------------------------------------------------------------
  _d_: dash projects     _m_: magit             _f_: fixme listing
  _p_: projectile        _t_: travis status     _F_: flycheck

  "
    ("<ESC>" nil "quit")
    ("d"   org-dashboard-display)
    ("p"   hydra-projectile/body)
    ("f"   fic-view-listing)
    ("F"   hydra-flycheck/body)
    ("m"   hydra-magit/body)
    ("t"   show-my-travis-projects)
    ("q"   nil "cancel" :color blue))
  (global-set-key (kbd "<f4>") 'hydra-project/body)
#+end_src
** default
   #+begin_src emacs-lisp :tangle yes
    (define-key emacs-lisp-mode-map (kbd "C-c C-c") 'eval-buffer)
   #+end_src
* Global
** ✰ Important test init.el

please test your init file when you modified done.

~M-x~ ~bug-hunter-init-file~
*** [[https://github.com/Malabarba/elisp-bug-hunter/][Malabarba/elisp-bug-hunter: Hunt down errors in elisp files.]]
#+begin_src emacs-lisp :tangle yes
    (use-package bug-hunter
    :straight (elisp-bug-hunter :type git
                                :host github
                                :repo "Malabarba/elisp-bug-hunter"))

#+end_src
** setting
#+begin_src emacs-lisp :tangle yes


(setq-default default-tab-width 4)
;; 禁止响铃
(setq ring-bell-function 'ignore)
;; 设置光标形状
;;(setq-default cursor-type '(bar . 3))
;; 高亮当前行
(global-hl-line-mode t)

;; (setq org-hide-block-startup t)
#+end_src


- [[https://github.com/magit/magit/issues/2212][.git/index.lock is unexpectedly held by some process of unknown origin · Issue #2212 · magit/magit]]
#+begin_src emacs-lisp :tangle yes
;(remove-hook 'find-file-hooks 'vc-find-file-hook)

 
#+end_src

** unloading
- [[https://github.com/cibinmathew/my-dotfiles/blob/f885a8146b2674c1229f645436451dd587008e64/.emacs.d/my-files/config/personal-configs/added-april.el][my-dotfiles/added-april.el at f885a8146b2674c1229f645436451dd587008e64 · cibinmathew/my-dotfiles]]
#+begin_src emacs-lisp :tangle yes

(use-package eww
:ensure nil
:disabled t)


#+end_src
** Macos
#+begin_src emacs-lisp :tangle yes

   (use-package macos
     :load-path "./setup"
     :if (memq window-system '(mac ns))
     )

#+end_src
*** setup/macos.el
#+begin_src emacs-lisp :tangle "./setup/macos.el"

(setq-default cursor-type 'bar)

(blink-cursor-mode -1)
(set-cursor-color "yellow1")

(setq insert-directory-program "/usr/local/bin/gls")
(org-link-set-parameters "skim" :follow #'org-mac-skim-open)
(defun org-mac-skim-open (uri)
  "Visit page of pdf in Skim"
  (let* ((page (when (string-match "::\\(.+\\)\\'" uri)
                 (match-string 1 uri)))
         (document (substring uri 0 (match-beginning 0))))
    (do-applescript
     (concat
      "tell application \"Skim\"\n"
      "activate\n"
      "set theDoc to \"" document "\"\n"
      "set thePage to " page "\n"
      "open theDoc\n"
      "go document 1 to page thePage of document 1\n"
      "end tell"))))


;; librime 
(setq load-path (cons (file-truename "~/.emacs.d/") load-path))

(require 'pyim)
(require 'posframe)
(require 'liberime)

(setq pyim-page-tooltip 'posframe)
(setq pyim-page-length 9)

(liberime-start "/Library/Input Methods/Squirrel.app/Contents/SharedSupport" (file-truename "~/.emacs.d/pyim/rime/"))
(liberime-select-schema "luna_pinyin_simp")
(setq pyim-default-scheme 'rime-quanpin)

(provide 'macos)

#+end_src
** Linux
#+begin_src emacs-lisp :tangle yes
(use-package linux
:load-path "./setup"
:if (eq system-type 'gnu/linux)
)
#+end_src

#+begin_src emacs-lisp :tangle "./setup/linux.el"
(setq-default cursor-type 'box)

(blink-cursor-mode -1)
(set-cursor-color "IndianRed3")

(provide 'linux)
#+end_src
** Undo
   #+begin_src emacs-lisp :tangle yes
     (use-package undo-propose
       :straight t
       :disabled t
       :commands (undo-propose)
       :bind ("C-x u" . undo-propose))


(straight-use-package 'undo-tree)
(global-undo-tree-mode 1)

;;TODO: undo-tree-auto-save-history
   #+end_src
** Custom
#+begin_src emacs-lisp :tangle yes

        (custom-set-faces
         '(ivy-current-match ((t (:background "grey70" :foreground "DarkOrchid3"))))
      '(ivy-highlight-face             ((t (:background nil :foreground nil :underline unspecified :weight unspecified))))
         '(ivy-minibuffer-match-face-1 ((t (:underline t :foreground "LightGreen" :inherit bold))))
         '(ivy-minibuffer-match-face-2 ((t (:underline t :foreground "LightGreen"))))
         '(ivy-minibuffer-match-face-3 ((t (:underline t :foreground "LightGreen"))))
         '(ivy-minibuffer-match-face-4 ((t (:underline t :foreground "LightGreen"))))
         '(swiper-match-face-1 ((t (:underline t :foreground "LightGreen" :inherit bold))))
         '(swiper-line-face ((t (:background "grey70" :foreground "DarkOrchid3"))))
         '(centaur-tabs-close-selected((t ( :foreground "DarkGray"))))
         '(centaur-tabs-modified-marker-selected ((t ( :foreground "yellow2"))))
         '(centaur-tabs-selected ((t ( :foreground "LimeGreen"))))
         '(centaur-tabs-unselected ((t ( :foreground "DarkSlateGray4"))))
           ) 
        (setq ivy-format-function 'ivy-format-function-line)


#+end_src

